cf_billing/Documents/бестИзменениеТарифнойСетки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеТарифнойСетки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестЗначенияТарифнойСетки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифныеКоэффициенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестИзменениеТарифнойСетки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса = Новый Структура;
	Схема = Неопределено;
	
	ДобавитьТекстЗапросаЗначенияТарифнойСтавки(Схема, Регистры);
	
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", ДокументСсылка);
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаЗначенияТарифнойСтавки(Схема, Регистры)
	
	ИмяРегистра = "бестЗначенияТарифнойСетки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	бестИзменениеТарифнойСетки.Дата КАК Период,
	|	бестИзменениеТарифнойСетки.Организация КАК Организация,
	|	бестИзменениеТарифнойСетки.ТарифнаяСетка КАК ТарифнаяСетка,
	|	НАЧАЛОПЕРИОДА(бестИзменениеТарифнойСеткиТарифныеКоэффициенты.Месяц, МЕСЯЦ) КАК Месяц,
	|	бестИзменениеТарифнойСеткиТарифныеКоэффициенты.Услуга КАК Услуга,
	|	бестИзменениеТарифнойСеткиТарифныеКоэффициенты.Значение КАК Значение
	|ИЗ
	|	Документ.бестИзменениеТарифнойСетки.ТарифныеКоэффициенты КАК бестИзменениеТарифнойСеткиТарифныеКоэффициенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменениеТарифнойСетки КАК бестИзменениеТарифнойСетки
	|		ПО бестИзменениеТарифнойСеткиТарифныеКоэффициенты.Ссылка = бестИзменениеТарифнойСетки.Ссылка
	|ГДЕ
	|	бестИзменениеТарифнойСетки.Ссылка В(&мДокументы)";		
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
